import { Detail } from "@raycast/api";
import { useState } from "react";
import useInterval from "use-interval";

const FRAMES_COUNT = 16;
const FRAME_DELAY = 1000; // 1 секунда задержки

export default function Command() {
    const [frameIndex, setFrameIndex] = useState(0);

    useInterval(() => {
        setFrameIndex((prevIndex) => (prevIndex + 1) % FRAMES_COUNT);
    }, FRAME_DELAY);

    const frame = getFrame(frameIndex);

    const text = `
Starting square breathing 🪷\n
Such cycles should be repeated for 1-3 minutes, but preferably 4-5 minutes. This technique is designed to help you relax after a long day, or before/after a challenging task or conversation.
`;

    return (
        <Detail markdown={`\`\`\`\n${frame}\n\`\`\`\n${text}`} />
    );
}

const frames: string[] = [ 
    `
                                            ╔════════════════╗
                                            ║░░░░            ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ╚════════════════╝                                                                             
                                                  INHALE
    `,
    `
                                            ╔════════════════╗
                                            ║░░░░░░░░        ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ╚════════════════╝
                                                  INHALE
    `,
    `
                                            ╔════════════════╗
                                            ║░░░░░░░░░░░░    ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ╚════════════════╝
                                                  INHALE
    `,
    `
                                            ╔════════════════╗
                                            ║░░░░░░░░░░░░░░░░║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ╚════════════════╝
                                                  INHALE
    `,
    `
                                            ╔════════════════╗
                                            ║░░░░░░░░░░░░░░░░║
                                            ║               ░║
                                            ║               ░║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ╚════════════════╝
                                                   HOLD
    `,
    `
                                            ╔════════════════╗
                                            ║░░░░░░░░░░░░░░░░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ║                ║
                                            ╚════════════════╝
                                                   HOLD
    `,
    `
                                            ╔════════════════╗
                                            ║░░░░░░░░░░░░░░░░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║                ║
                                            ║                ║
                                            ╚════════════════╝
                                                   HOLD
    `,
    `
                                            ╔════════════════╗
                                            ║░░░░░░░░░░░░░░░░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ╚════════════════╝
                                                   HOLD
    `,
    `
                                            ╔════════════════╗
                                            ║░░░░░░░░░░░░░░░░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║            ░░░░║
                                            ╚════════════════╝
                                                  EXHALE
    `,
    `
                                            ╔════════════════╗
                                            ║░░░░░░░░░░░░░░░░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║        ░░░░░░░░║
                                            ╚════════════════╝
                                                  EXHALE
    `,
    `
                                            ╔════════════════╗
                                            ║░░░░░░░░░░░░░░░░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║      ░░░░░░░░░░║
                                            ╚════════════════╝
                                                  EXHALE
    `,
    `
                                            ╔════════════════╗
                                            ║░░░░░░░░░░░░░░░░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║░░░░░░░░░░░░░░░░║
                                            ╚════════════════╝
                                                  EXHALE
    `,
    `
                                            ╔════════════════╗
                                            ║░░░░░░░░░░░░░░░░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║░              ░║
                                            ║░              ░║
                                            ║░░░░░░░░░░░░░░░░║
                                            ╚════════════════╝
                                                  HOLD
    `,
    `
                                            ╔════════════════╗
                                            ║░░░░░░░░░░░░░░░░║
                                            ║               ░║
                                            ║               ░║
                                            ║               ░║
                                            ║░              ░║
                                            ║░              ░║
                                            ║░              ░║
                                            ║░              ░║
                                            ║░░░░░░░░░░░░░░░░║
                                            ╚════════════════╝
                                                  HOLD
    `,
    `
                                            ╔════════════════╗
                                            ║░░░░░░░░░░░░░░░░║
                                            ║               ░║
                                            ║░              ░║
                                            ║░              ░║
                                            ║░              ░║
                                            ║░              ░║
                                            ║░              ░║
                                            ║░              ░║
                                            ║░░░░░░░░░░░░░░░░║
                                            ╚════════════════╝
                                                  HOLD
    `,
    `
                                            ╔════════════════╗
                                            ║░░░░░░░░░░░░░░░░║
                                            ║░              ░║
                                            ║░              ░║
                                            ║░              ░║
                                            ║░              ░║
                                            ║░              ░║
                                            ║░              ░║
                                            ║░              ░║
                                            ║░░░░░░░░░░░░░░░░║
                                            ╚════════════════╝
                                                  HOLD
    `
];

function getFrame(index: number): string {
    return frames[index];
}
