[
  {
    "character": "Dwight Schrute",
    "content": "Jim is gone. He's gone. I miss him so much. Ooooh I cry myself to sleep, Jim! False. I do not miss him."
  },
  {
    "character": "Dwight Schrute",
    "content": "Would I ever leave this company? Look, I’m all about loyalty. In fact, I feel like part of what I’m being paid for here is my loyalty. But if there were somewhere else that valued loyalty more highly… I’m going wherever they value loyalty the most."
  },
  {
    "character": "Dwight Schrute",
    "content": "I am fast. To give you a reference point I am somewhere between a snake and a mongoose… And a panther."
  },
  {
    "character": "Dwight Schrute",
    "content": "Security in this office park is a joke. Last year I came to work with my spud-gun in a duffel bag. I sat at my desk all day with a rifle that shoots potatoes at 60 pounds per square inch. Can you imagine if I was deranged?"
  },
  {
    "character": "Dwight Schrute",
    "content": "I grew up on a farm. I have seen animals having sex in every position imaginable. Goat on chicken. Chicken on goat. Couple of chickens doing a goat, couple of pigs watching."
  },
  {
    "character": "Dwight Schrute",
    "content": "Through concentration, I can raise and lower my cholesterol at will."
  },
  {
    "character": "Jim Halpert",
    "content": "Right now, this is just a job. If I advance any higher in this company, then this would be my career. And, well, if this were my career? I'd have to throw myself in front of a train."
  },
  {
    "character": "Michael Scott",
    "content": "Am I going to tell them? No, I am not going to tell them. I don't see the point of that. As a doctor, you would not tell a patient if they had cancer."
  },
  {
    "character": "Michael Scott",
    "content": "Wikipedia Is The Best Thing Ever. Anyone In The World Can Write Anything They Want About Any Subject, So You Know You Are Getting The Best Possible Information."
  },
  {
    "character": "Oscar Martinez",
    "content": "Saddle Shoes With Denim? I Will Literally Call Protective Services."
  },
  {
    "character": "Michael Scott",
    "content": "Hate To See You Leave But Love To Watch You Go. ‘Cause Of Your Butt."
  },
  {
    "character": "Phyllis Vance",
    "content": "I Wonder What People Like About Me? Probably My Jugs."
  },
  {
    "character": "Jim Halpert",
    "content": "Right Now This Is Just A Job. If I Advance Any Higher In This Company, Then This Would Be My Career. And Well, If This Were My Career I’d Have To Throw Myself In Front Of A Train."
  },
  {
    "character": "Jim Halpert",
    "content": "Bears. Beets. Battlestar Galactica.",
    "season": "3"
  },
  {
    "character": "Michael Scott",
    "content": "I Love Inside Jokes. Love To Be A Part Of One Someday."
  },
  {
    "content": "I wish there was a way to know you’re in the good old days, before you’ve actually left them.",
    "character": "Andy Bernard",
    "season": "9"
  },
  {
    "content": "Sometimes I'll start a sentence and I don't even know where it's going. I just hope I find it along the way.",
    "character": "Michael Scott",
    "season": "5"
  },
  {
    "character": "Dwight Schrute",
    "content": "How Would I Describe Myself? Three Words. Hard-working. Alpha Male. Jackhammer. Merciless. Insatiable."
  },
  {
    "character": "Michael Scott",
    "content": "It’s Never Too Early For Ice-Cream, Jim."
  },
  {
    "character": "Dwight Schrute",
    "content": "Why Are All These People Here? There Are Too Many People On This Earth. We Need A New Plague."
  },
  {
    "character": "Andy Bernard",
    "content": "Andy Bernard Does Not Lose Contests. He Wins Them… Or He Quits Them Because They Are Unfair."
  },
  {
    "character": "Dwight Schrute",
    "content": "You Couldn’t Handle My Undivided Attention."
  },
  {
    "character": "Michael Scott",
    "content": "That’s What She Said!"
  },
  {
    "character": "Dwight Schrute",
    "content": "Welcome to the Hotel Hell. Check-in time in now, check-out time is never."
  },
  {
    "character": "Dwight Schrute",
    "content": "I'm the owner.. the co-owner. With Satan!"
  },
  {
    "character": "Angela Martin",
    "content": "I'm not gaining anything from this seminar. I'm a professional woman. The head of accounting. I'm in the healthiest relationship of my life. I just think it's insulting that Jan thinks we need this. And, apparently, judging from her outfit, Jan aspires to be a whore."
  },
  {
    "character": "Angela Martin",
    "content": "Poop is raining from the ceilings. Poop!"
  },
  {
    "character": "Ryan Howard",
    "content": "Stanley yelled at me today. That was one of the most frightening experiences of my life."
  },
  {
    "character": "Michael Scott",
    "content": "Yes, it is true. I, Michael Scott, am signing up with an online dating service. Thousands of people have done it, and I am going to do it. I need a username. And... I have a great one [types]. Little kid lover. That way, people will know exactly where my priorities are at."
  },
  {
    "character": "Michael Scott",
    "content": "I'll catch you on the flippity-flip. Bye!"
  },
  {
    "character": "Michael Scott",
    "content": "It's not that children make me uncomfortable, it's just that, why be a dad when you can be a fun uncle? I've never heard of anyone rebelling against their fun uncle."
  },
  {
    "character": "Dwight Schrute",
    "content": "The Japanese camp guards of World War II always chose one man to kill whenever a batch of new prisoners arrived. I always wondered how they chose the man who was to die. I think I would have been good at choosing the person."
  },
  {
    "character": "Michael Scott",
    "content": "Close your eyes. Picture a convict. What's he wearing? Nothing special, baseball cap on backwards, baggy pants... he says something ordinary like... 'yo, thats shizzle.' Okay. Now slowly open your eyes again. Who are you picturing? A black man? Wrong. That was a white woman. Surprised? Well, shame on you."
  },
  {
    "character": "Michael Scott",
    "content": "You may look around and see two groups here: white collar, blue collar. But I don't see it that way, and you know why not? Because I am collar-blind.",
    "season": "2",
    "episode": "15"
  },
  {
    "character": "Michael Scott",
    "content": "Fool me once, strike one. Fool me twice, strike three.",
    "season": "3",
    "episode": "13"
  },
  {
    "character": "Michael Scott",
    "content": "Sometimes you have to take a break from being the kind of boss that's always trying to teach people things. Sometimes you just have to be the boss of dancing.",
    "season": "2",
    "episode": "11"
  },
  {
    "character": "Michael Scott",
    "content": "Make friends first, make sales second, make love third. In no particular order.",
    "season": "6",
    "episode": "20"
  },
  {
    "character": "Michael Scott",
    "content": "People will never be replaced by machines. In the end, life and business are about human connections. And computers are about trying to murder you in a lake. And to me the choice is easy.",
    "season": "4",
    "episode": "3"
  },
  {
    "character": "Kevin Malone",
    "content": "When me president, they see. They see.",
    "season": "8",
    "episode": "2"
  },
  {
    "character": "Kevin Malone",
    "content": "Yes, me do.",
    "season": "8",
    "episode": "2"
  },
  {
    "character": "Kevin Malone",
    "content": "Body strong. Sleep big last night.",
    "season": "8",
    "episode": "2"
  },
  {
    "character": "Kevin Malone",
    "content": "Why waste time say lot word when few word do trick?",
    "season": "8",
    "episode": "2"
  },
  {
    "content": "That's what she said!",
    "character": "Michael Scott",
    "season": "1"
  },
  {
    "content": "Mini cupcakes? As in the mini version of regular cupcakes? Which is already a mini version of cake? Honestly, where does it end with you people?",
    "character": "Kevin Malone",
    "season": "9"
  },
  {
    "content": "Whenever I'm about to do something, I think, 'Would an idiot do that?' and if they would, I do not do that thing.",
    "character": "Dwight Schrute",
    "season": "3"
  },
  {
    "content": "’R’ is among the most menacing of sounds. That’s why they call it ‘murder’ and not ‘mukduk.",
    "character": "Dwight Schrute",
    "season": "6"
  },
  {
    "content": "I feel God in this Chili's tonight",
    "character": "Pam Beesly",
    "season": "2"
  },
  {
    "content": "Who is Justice Beaver",
    "character": "Dwight Schrute",
    "season": "7"
  },
  {
    "content": "I talk a lot, so I've learned to tune myself out.",
    "character": "Kelly Kapoor",
    "season": "7"
  },
  {
    "content": "Would I rather be feared or loved? Easy. Both. I want people to be afraid of how much they love me.",
    "character": "Michael Scott",
    "season": "2"
  },
  {
    "content": "I’m not superstitious, but I am a little stitious.",
    "character": "Michael Scott",
    "season": "4"
  },
  {
    "content": "If I don’t have some cake soon, I might die.",
    "character": "Stanley Hudson",
    "season": "4"
  },
  {
    "content": "I just want to lie on the beach and eat hot dogs. That’s all I’ve ever wanted.",
    "character": "Kevin Malone",
    "season": "3"
  },
  {
    "content": "I wanted to eat a pig in a blanket... in a blanket.",
    "character": "Kevin Malone",
    "season": "7"
  },
  {
    "character": "Michael Scott",
    "content": "Guess what, I have flaws. What are they? Oh, I don’t know. I sing in the shower. Sometimes I spend too much time volunteering. Occasionally I’ll hit somebody with my car. So sue me."
  },
  {
    "character": "Michael Scott",
    "content": "I saved a life. My own. Am I a hero?… I really can’t say, but yes!"
  },
  {
    "character": "Michael Scott",
    "content": "No, I’m not going to tell them about the downsizing. If a patient has cancer, you don’t tell them."
  },
  {
    "character": "Michael Scott",
    "content": "An office is not for dying. An office is a place for living life to the fullest, to the max, to… an office is a place where dreams come true."
  },
  {
    "character": "Michael Scott",
    "content": "Do I need to be liked? Absolutely not. I like to be liked. I enjoy being liked. I have to be liked, but it’s not like this compulsive need to be liked, like my need to be praised."
  },
  {
    "character": "Michael Scott",
    "content": "Sometimes I’ll start a sentence, and I don’t even know where it’s going. I just hope I find it along the way."
  },
  {
    "character": "Michael Scott",
    "content": "Do I have a special someone? Well, yeah, of course. A bunch of ’em. My employees."
  },
  {
    "character": "Michael Scott",
    "content": "They say on your deathbed you never wish you spent more time at the office — but I will."
  },
  {
    "character": "Michael Scott",
    "content": "I love inside jokes. I hope to be a part of one someday."
  },
  {
    "character": "Michael Scott",
    "content": "I’m an early bird and a night owl. So I’m wise and have worms."
  },
  {
    "character": "Michael Scott",
    "content": "Well, it’s love at first sight. Actually, it was… no, it was when I heard her voice. It was love at first see with my ears."
  },
  {
    "character": "Michael Scott",
    "content": "The most sacred thing I do is care and provide for my workers, my family. I give them money. I give them food. Not directly, but through the money."
  },
  {
    "character": "Michael Scott",
    "content": "I wanna be married and have 100 kids so I can have 100 friends and no one can say ‘no’ to being my friend."
  },
  {
    "character": "Michael Scott",
    "content": "I feel like all my kids grew up and then they married each other. It’s every parent’s dream."
  },
  {
    "character": "Michael Scott",
    "content": "You know what they say ‘Fool me once, strike one, but fool me twice… strike three.’"
  },
  {
    "character": "Michael Scott",
    "content": "I know it’s illegal in Pennsylvania, but it’s for charity, and I consider myself a great philanderer."
  },
  {
    "character": "Michael Scott",
    "content": "Two queens at casino night. I am gonna drop a deuce on everybody."
  },
  {
    "character": "Michael Scott",
    "content": "I don’t understand. We have a day honoring Martin Luther King, but he didn’t even work here."
  },
  {
    "character": "Michael Scott",
    "content": "Now, you may look around and see two groups here. White-collar, blue-collar. But I don’t see it that way. And you know why not? Because I am collar-blind."
  },
  {
    "character": "Michael Scott",
    "content": "And I’m optimistic because every day I get a little more desperate."
  },
  {
    "character": "Michael Scott",
    "content": "I am Beyonce, always."
  },
  {
    "character": "Michael Scott",
    "content": "It’s not like booze ever killed anyone."
  },
  {
    "character": "Michael Scott",
    "content": "And I knew exactly what to do. But in a much more real sense, I had no idea what to do."
  },
  {
    "character": "Michael Scott",
    "content": "The worst thing about prison was the dementors."
  },
  {
    "character": "Michael Scott",
    "content": "There’s no such thing as an appropriate joke. That’s why it’s called a joke."
  },
  {
    "character": "Michael Scott",
    "content": "Society teaches us that having feelings and crying is bad and wrong. Well, that’s baloney, because grief isn’t wrong. There’s such a thing as good grief. Just ask Charlie Brown."
  },
  {
    "character": "Michael Scott",
    "content": "I say dance, they say ‘How high?'"
  },
  {
    "character": "Michael Scott",
    "content": "Tell him to call me ASAP as possible."
  },
  {
    "character": "Michael Scott",
    "content": "Presents are the best way to show how much you care. It’s a tangible thing you can point at and say, ‘Hey man, I love you. This many dollars worth.’"
  },
  {
    "character": "Michael Scott",
    "content": "Dwight, you ignorant slut."
  },
  {
    "character": "Michael Scott",
    "content": "I want you to rub butter on my foot… Pam, please? I have Country Crock."
  },
  {
    "character": "Michael Scott",
    "content": "There is no greater feeling than when two people who are perfect for each other overcome all obstacles and find true love."
  },
  {
    "character": "Michael Scott",
    "content": "About 40 times a year, Michael gets sick but has no symptoms. Dwight is always gravely concerned."
  },
  {
    "character": "Michael Scott",
    "content": "There were these huge bins of clothes and everybody was rifling through them like crazy. And I grabbed one and it fit! So, I don’t think that this is totally just a woman’s suit. At the very least it’s bisexual."
  },
  {
    "character": "Michael Scott",
    "content": "Any man who says he totally understands women is a fool. Because they are un-understandable."
  },
  {
    "character": "Michael Scott",
    "content": "When the son of the deposed king of Nigeria emails you directly, asking for help, you help! His father ran the freaking country! OK?"
  },
  {
    "character": "Michael Scott",
    "content": "I had a great summer. I got West Nile virus, lost a ton of weight. Then I went back to the lake. And I stepped on a piece of glass in the parking lot, which hurt. That got infected. Even though I peed on it."
  },
  {
    "character": "Michael Scott",
    "content": "Friends joke with one another. ‘Hey, you’re poor.’ ‘Hey, your mama’s dead.’ That’s what friends do."
  },
  {
    "character": "Michael Scott",
    "content": "I am running away from my responsibilities. And it feels good."
  },
  {
    "character": "Michael Scott",
    "content": "Toby is in HR, which technically means he works for corporate. So he’s not really a part of our family. Also, he’s divorced, so he’s not really a part of his family."
  },
  {
    "character": "Michael Scott",
    "content": "Saw Inception. Or at least I dreamt I did."
  },
  {
    "character": "Michael Scott",
    "content": "Jan is cold. If she was sitting across from you on a train and she wasn’t moving, you might think she was dead."
  },
  {
    "character": "Michael Scott",
    "content": "Number eight. Learn how to take off a woman’s bra: You just twist your hand until something breaks."
  },
  {
    "character": "Michael Scott",
    "content": "I don’t come up with this stuff, I just forward it along. You wouldn’t arrest the guy who was just passing drugs from one guy to another."
  },
  {
    "character": "Michael Scott",
    "content": "I love my employees even though I hit one of you with my car."
  },
  {
    "character": "Michael Scott",
    "content": "I would not miss it for the world. But if something else came up, I would definitely not go."
  },
  {
    "character": "Michael Scott",
    "content": "This is our receptionist, Pam. If you think she’s cute now, you should have seen her a couple years ago."
  },
  {
    "character": "Michael Scott",
    "content": "Like right here is my favorite New York pizza joint. And I’m going to go get me a New York slice."
  },
  {
    "character": "Michael Scott",
    "content": "Sometimes you have to take a break from being the kind of boss that’s always trying to teach people things. Sometimes you just have to be the boss of dancing."
  },
  {
    "character": "Michael Scott",
    "content": "Nobody likes beets, Dwight! Why don’t you grow something that everybody does like? You should grow candy."
  },
  {
    "character": "Michael Scott",
    "content": "It takes you thirty seconds to brush your teeth? Wow, that’s ten times as long as it takes me."
  },
  {
    "character": "Michael Scott",
    "content": "I took her to the hospital. And the doctors tried to save her life, they did the best they could. And she is going to be OK."
  },
  {
    "character": "Michael Scott",
    "content": "Yes, it is true. I, Michael Scott, am signing up with an online dating service. Thousands of people have done it, and I am going to do it. I need a username. And I have a great one. Little Kid Lover. That way people will know exactly where my priorities are at."
  },
  {
    "character": "Michael Scott",
    "content": "Hi, I’m Date Mike. Nice to meet me. How do you like your eggs in the morning?"
  },
  {
    "character": "Michael Scott",
    "content": "I’ve got to make sure that YouTube comes down to tape this."
  },
  {
    "character": "Michael Scott",
    "content": "OK, too many different words from coming at me from too many different sentences."
  },
  {
    "character": "Michael Scott",
    "content": "The people that you work with are, when you get down to it, your very best friends."
  },
  {
    "character": "Michael Scott",
    "content": "Webster’s Dictionary defines wedding as ‘the fusing of two metals with a hot torch.'"
  },
  {
    "character": "Michael Scott",
    "content": "Granted, maybe this was not the best idea, but at least we care enough about our employees that we are willing to fight for them."
  },
  {
    "character": "Michael Scott",
    "content": "I guess the attitude that I’ve tried to create here is that I’m a friend first and a boss second and probably an entertainer third."
  },
  {
    "character": "Michael Scott",
    "content": "Pizza: the great equalizer."
  },
  {
    "character": "Michael Scott",
    "content": "Reverse psychology is an awesome tool. I don’t know if you guys know about it, but, basically, you make someone think the opposite of what you believe. And that tricks them into doing something stupid. Works like a charm."
  },
  {
    "character": "Michael Scott",
    "content": "I am Michael, and I am part English, Irish, German, and Scottish… sort of a virtual United Nations."
  },
  {
    "character": "Michael Scott",
    "content": "If you don’t like it, Stanley, you can go to the back of the bus, or the front of the bus, or drive the bus."
  },
  {
    "character": "Michael Scott",
    "content": "If you break that girl’s heart, I will kill you. That’s just a figure of speech. But seriously, if you break that girl’s heart, I will literally kill you and your entire family."
  },
  {
    "character": "Michael Scott",
    "content": "My mind is going a mile an hour."
  },
  {
    "character": "Michael Scott",
    "content": "It’s a pimple, Phyllis. Avril Lavigne gets them all the time, and she rocks harder than anyone alive."
  },
  {
    "character": "Michael Scott",
    "content": "Is there something besides ‘Mexican’ you prefer to be called? Something less offensive?"
  },
  {
    "character": "Michael Scott",
    "content": "It just seems awfully mean. But sometimes, the ends justify the mean."
  },
  {
    "character": "Michael Scott",
    "content": "No, Rose, they are not breathing. And they have no arms or legs… Where are they? You know what? If we come across somebody with no arms or legs, do we bother resuscitating them? I mean, what quality of life do we have there?"
  },
  {
    "character": "Michael Scott",
    "content": "Abraham Lincoln once said that, ‘If you’re a racist, I will attack you with the North.’ And those are the principles that I carry with me in the workplace."
  },
  {
    "character": "Michael Scott",
    "content": "They say that your wedding day goes by in such a flash that you’re lucky if you even get a piece of your own cake. I say that’s crazy. I say let them eat cake. Margaret Thatcher said that about marriage. Smart broad."
  },
  {
    "character": "Michael Scott",
    "content": "Here it is, heart of New York City, Times Square… named for the good times you have when you’re in it."
  },
  {
    "character": "Michael Scott",
    "content": "Two weeks ago, I was in the worst relationship of my life. She treated me poorly, we didn’t connect, I was miserable. Now, I am in the best relationship of my life, with the same woman. Love is a mystery."
  },
  {
    "character": "Michael Scott",
    "content": "You will not die! Stanley! Stanley! Barack is President! You are black, Stanley!"
  },
  {
    "character": "Michael Scott",
    "content": "I want today to be a beautiful memory that the staff and I share after I have passed on to New York. And if Toby is a part of it, then it’ll suck."
  },
  {
    "character": "Michael Scott",
    "content": "I think Angela might be gay. Could Oscar and Angela be having a gay affair? Maybe! Is that what this is about?"
  },
  {
    "character": "Michael Scott",
    "content": "That was offensive and lame. So double offensive. This is an environment of welcoming and you should just get the hell out of here."
  },
  {
    "character": "Michael Scott",
    "content": "Oh, this is gonna feel so good getting this thing off my chest… that’s what she said."
  },
  {
    "character": "Michael Scott",
    "content": "Well, well, well, how the turntables."
  },
  {
    "character": "Michael Scott",
    "content": "We’re all homos. Homo… Sapiens."
  },
  {
    "character": "Michael Scott",
    "content": "You cheated on me? When I specifically asked you not to?"
  },
  {
    "character": "Michael Scott",
    "content": "I don’t want any special treatment, Pam. I just want you to treat me like you would some family member who’s undergone some sort of serious physical trauma. I don’t think that’s too much to ask?"
  },
  {
    "character": "Michael Scott",
    "content": "I enjoy having breakfast in bed. I like waking up to the smell of bacon, sue me. And since I don’t have a butler, I do it myself. So, most nights before I go to bed, I will lay six strips of bacon out on my George Foreman Grill. Then I go to sleep. When I wake up, I plug in the grill, I go back to sleep again. Then I wake up to the smell of crackling bacon."
  },
  {
    "character": "Michael Scott",
    "content": "Well, happy birthday, Jesus. Sorry that your party’s so lame."
  },
  {
    "character": "Michael Scott",
    "content": "It’s a good thing Russia doesn’t exist anymore."
  },
  {
    "character": "Michael Scott",
    "content": "Do you think that doing alcohol is cool?"
  },
  {
    "character": "Michael Scott",
    "content": "I hate so much about the things you choose to be."
  },
  {
    "character": "Michael Scott",
    "content": "It’s never too early for ice cream."
  },
  {
    "character": "Michael Scott",
    "content": "When I discovered YouTube, I didn’t work for five days."
  },
  {
    "character": "Michael Scott",
    "content": "Occasionally, I’ll hit someone with my car. So sue me."
  },
  {
    "character": "Michael Scott",
    "content": "I saved a life — my own."
  },
  {
    "character": "Michael Scott",
    "content": "That has sort of an oaky afterbirth."
  },
  {
    "character": "Michael Scott",
    "content": "I learned a while back that if I do not text 911, people do not return my calls. Um, but now people always return my calls because they think that something horrible has happened."
  },
  {
    "character": "Michael Scott",
    "content": "I have cause. It’s beCAUSE I hate him."
  },
  {
    "character": "Michael Scott",
    "content": "I live by one rule: No office romances, no way. Very messy, inappropriate… no. But, I live by another rule: Just do it… Nike."
  },
  {
    "character": "Michael Scott",
    "content": "I’m not a millionaire. I thought I would be by the time I was 30, but I wasn’t even close. Then I thought maybe by 40, but by 40, I had less money than I did when I was 30."
  },
  {
    "character": "Michael Scott",
    "content": "I’m not usually the butt of the joke. I’m usually the face of the joke."
  },
  {
    "character": "Michael Scott",
    "content": "The rules of shotgun are very simple and very clear. The first person to shout ‘shotgun’ when you’re within sight of the car gets the front seat. That’s how the game’s played. There are no exceptions for someone with a concussion."
  },
  {
    "character": "Michael Scott",
    "content": "You are as creepy as a real serial killer. For real."
  },
  {
    "character": "Michael Scott",
    "content": "You all took a life here today. You did. The life of the party."
  },
  {
    "character": "Michael Scott",
    "content": "I fell in love with these kids. And I didn’t want to see them fall victim to the system. So I made ’em a promise. I told them if they graduated from high school, I would pay for their college education. I have made some empty promises in my life but, hands down, that was the most generous."
  },
  {
    "character": "Michael Scott",
    "content": "Last, and possibly least, you didn’t think we’d forget, ‘That’s what she said!’"
  },
  {
    "character": "Michael Scott",
    "content": "My philosophy is, basically this. And this is something that I live by. And I always have. And I always will. Don’t, ever, for any reason, do anything, to anyone, for any reason, ever, no matter what, no matter where, or who you are with, or, or where you are going, or, or where you’ve been. Ever. For any reason. Whatsoever."
  },
  {
    "character": "Michael Scott",
    "content": "Dwight, you ignorant slut!"
  },
  {
    "character": "Michael Scott",
    "content": "If I had a gun with two bullets and I was in a room with Hitler, Bin Laden, and Toby, I would shoot Toby twice."
  },
  {
    "character": "Michael Scott",
    "content": "Nobody should have to go to work thinking, ‘Oh, this is the place that I might die today.’ That’s what a hospital is for. An office is for not dying. An office is a place to live life to the fullest. To the max. To… an office is a place where dreams come true."
  },
  {
    "character": "Michael Scott",
    "content": "You miss 100 percent of the shots you don’t take. Wayne Gretzky."
  },
  {
    "character": "Michael Scott",
    "content": "I… declare…. bankruptcy!"
  },
  {
    "character": "Michael Scott",
    "content": "It is St. Patrick’s Day. And here in Scranton, that is a huge deal. It is the closest that the Irish will ever get to Christmas."
  },
  {
    "character": "Michael Scott",
    "content": "It’s Britney, bitch."
  },
  {
    "character": "Michael Scott",
    "content": "You don’t know me, you’ve just seen my penis."
  },
  {
    "character": "Michael Scott",
    "content": "I’m sinking a few, you know. Swish, swish, swish. Nothing but net. And their jaws just dropped to the floor. African-Americans!"
  },
  {
    "character": "Michael Scott",
    "content": "When I was five, I imagined that there was such a thing as a unicorn. And this was before I had even heard of one, or seen one. I just drew a picture, of a horse, that could fly over rainbows, and had a huge spike in its head. I was five! Five years old. Couldn’t even talk yet."
  },
  {
    "character": "Michael Scott",
    "content": "Jim and I are great friends. We hang out a ton, mostly at work."
  },
  {
    "character": "Michael Scott",
    "content": "As it turns out, you can’t just check someone into rehab against their will. They have to do it voluntarily. They have to hit rock bottom. So, I think I know what I need to do at this point. I need to find ways to push Meredith to the bottom. Um. I think I can do it."
  },
  {
    "character": "Michael Scott",
    "content": "They always say that it’s a mistake to hire your friends. And they are right. So, I hired my best friends. And this is what I get!?"
  },
  {
    "character": "Michael Scott",
    "content": "The only time I set the bar low is for limbo."
  },
  {
    "character": "Michael Scott",
    "content": "Don’t ever, for any reason, do anything to anyone, for any reason, ever, no matter what."
  },
  {
    "character": "Michael Scott",
    "content": "It takes an advanced sense of humor. I don’t expect everyone to understand."
  },
  {
    "character": "Michael Scott",
    "content": "I’m not gonna cry over it. I did that in the car on the way home."
  },
  {
    "character": "Dwight Schrute",
    "content": "Before I do anything I ask myself, ‘Would an idiot do that?’ And if the answer is yes, I do not do that thing."
  },
  {
    "character": "Dwight Schrute",
    "content": "Who is Justice Beaver?"
  },
  {
    "character": "Dwight Schrute",
    "content": "Jim told me you could buy gaydar online."
  },
  {
    "character": "Dwight Schrute",
    "content": "I never thought I’d say this, but I think I ate too much bone marrow."
  },
  {
    "character": "Dwight Schrute",
    "content": "PowerPoints are the peacocks of the business world; all show, no meat."
  },
  {
    "character": "Dwight Schrute",
    "content": "I love catching people in the act. That’s why I always whip open doors."
  },
  {
    "character": "Dwight Schrute",
    "content": "The Civil War history industry has conveniently forgotten about the battle of Schrute Farms. Whatever. I’m over it. It’s just grossly irresponsible."
  },
  {
    "character": "Dwight Schrute",
    "content": "Bread is the paper of the food industry. You write your sandwich on it."
  },
  {
    "character": "Dwight Schrute",
    "content": "It’s better to be hurt by someone you know accidentally, than by a stranger on purpose."
  },
  {
    "character": "Dwight Schrute",
    "content": "In the end, the greatest snowball isn’t a snowball at all. It’s fear. Merry Christmas."
  },
  {
    "character": "Dwight Schrute",
    "content": "How would I describe myself? Three words: hardworking, alpha male, jackhammer, merciless, insatiable."
  },
  {
    "character": "Dwight Schrute",
    "content": "I wish I could menstruate. If I could menstruate, I wouldn’t have to deal with idiotic calendars anymore. I’d just be able to count down from my previous cycle. Plus, I’d be more in tune with the moon and the tides."
  },
  {
    "character": "Dwight Schrute",
    "content": "People underestimate the power of nostalgia. Nostalgia is truly one of the greatest human weaknesses, second only to the neck."
  },
  {
    "character": "Dwight Schrute",
    "content": "Why are all these people here? There’s too many people on this earth. We need a new plague."
  },
  {
    "character": "Dwight Schrute",
    "content": "When someone smiles at me, all I see is a chimpanzee begging for its life."
  },
  {
    "character": "Dwight Schrute",
    "content": "Yes. I have decided to shun Andy Bernard for the next three years. Which I’m looking forward to. It’s an Amish technique.It’s like slapping someone with sile"
  },
  {
    "character": "Dwight Schrute",
    "content": "I don’t have a lot of experience with vampires, but I have hunted werewolves. I shot one once, but by the time I got to it, it had turned back into my neighbor’s dog."
  },
  {
    "character": "Dwight Schrute",
    "content": "You better learn your rules. If you don’t, you’ll be eaten in your sleep."
  },
  {
    "character": "Dwight Schrute",
    "content": "Nothing stresses me out. Except having to seek the approval of my inferiors."
  },
  {
    "character": "Dwight Schrute",
    "content": "Michael is like Mozart, and I’m like Butch Cassidy. You mess with Mozart and you’re gonna get a bullet in your head, courtesy of Butch Cassidy."
  },
  {
    "character": "Dwight Schrute",
    "content": "My perfect Valentine’s day? I’m at home, three cell phones in front of me, fielding desperate calls from people who want to buy one of the fifty restaurant reservations I made over six months ago."
  },
  {
    "character": "Dwight Schrute",
    "content": "I’m gonna intimidate him, OK? Watch this… So anyways, she said that is the biggest penis I have ever seen, and I said I know! That’s why I brought you to the penis museum, where tickets are a thousand dollars."
  },
  {
    "character": "Dwight Schrute",
    "content": "Everyone, follow me to the shelter. We’ve got enough food for 14 days. After that, we have a difficult conversation."
  },
  {
    "character": "Dwight Schrute",
    "content": "I always wondered how they picked the person to die. I’d be good at picking the person."
  },
  {
    "character": "Dwight Schrute",
    "content": "When my mother was pregnant with me, they did an ultrasound and found she was having twins. When they did another ultrasound a few weeks later, they discovered that I had adsorbed the other fetus. Do I regret this? No, I believe his tissue has made me stronger. I now have the strength of a grown man and a little baby."
  },
  {
    "character": "Dwight Schrute",
    "content": "And I will travel to New Zealand. And walk the Lord of the Rings trail to Mordor."
  },
  {
    "character": "Dwight Schrute",
    "content": "When I die, I want to be frozen. And if they have to freeze me in pieces, so be it. I will wake up stronger than ever, because I will have used that time to figure out exactly why I died. And what moves I could have used to defend myself better now that I know what hold he had me in."
  },
  {
    "character": "Dwight Schrute",
    "content": "In an ideal world, I would have all 10 fingers on my left hand so my right hand could just be a fist for punching."
  },
  {
    "character": "Dwight Schrute",
    "content": "I am better than you have ever been or ever will be."
  },
  {
    "character": "Dwight Schrute",
    "content": "I am faster than 80 percent of all snakes."
  },
  {
    "character": "Dwight Schrute",
    "content": "Always the Padawan, never the Jedi."
  },
  {
    "character": "Dwight Schrute",
    "content": "There are three things you never turn your back on: bears, men you have wronged, and a dominant male turkey during mating season."
  },
  {
    "character": "Dwight Schrute",
    "content": "All you need is love? False. The four basic human necessities are air, water, food, and shelter."
  },
  {
    "character": "Dwight Schrute",
    "content": "I am ready to face any challenge that might be foolish enough to face me."
  },
  {
    "character": "Dwight Schrute",
    "content": "You think you’re excited? You should feel my nipples. Boing!"
  },
  {
    "character": "Dwight Schrute",
    "content": "And I misspelled, in front of the entire school, the word ‘failure.’"
  },
  {
    "character": "Dwight Schrute",
    "content": "I really like Andy these days. He’s pretended, and he does exactly as I tell him to. All that will change when real Andy comes back tomorrow. Unless he comes back as pretend Dwight. In which case, we’re in for an epic, confusing showdown."
  },
  {
    "character": "Dwight Schrute",
    "content": "Those who can’t farm, farm celery."
  },
  {
    "character": "Dwight Schrute",
    "content": "I saw Wedding Crashers accidentally. I bought a ticket for Grizzly Man and went into the wrong theater. After an hour, I figured I was in the wrong theater, but I kept waiting. ‘Cause that’s the thing about bear attacks… they come when you least expect it."
  },
  {
    "character": "Dwight Schrute",
    "content": "They say that no man is an island. False! I am an island and this island is volcanic. And it is about to erupt. With the molten hot lava of strategy!"
  },
  {
    "character": "Dwight Schrute",
    "content": "A real man swallows his vomit when a lady is present."
  },
  {
    "character": "Dwight Schrute",
    "content": "And I did not become a Lackawanna County volunteer sheriff’s deputy to make friends. And by the way, I haven’t."
  },
  {
    "character": "Dwight Schrute",
    "content": "In the wild, there is no healthcare. Healthcare is oh, I broke my leg! A lion comes and eats you, you’re dead. Well, I’m not dead, I’m the lion. You’re dead!"
  },
  {
    "character": "Dwight Schrute",
    "content": "Congratulations on your one cousin. I have seventy, each one better than the last!"
  },
  {
    "character": "Dwight Schrute",
    "content": "The hand that reaches from the grave to grip your throat is the strong hand you want on the wheel."
  },
  {
    "character": "Dwight Schrute",
    "content": "Women are like wolves. If you want one, you must trap it. Snare it. Tame it. Feed it."
  },
  {
    "character": "Dwight Schrute",
    "content": "Identity theft is not a joke, Jim! Millions of families suffer every year."
  },
  {
    "character": "Dwight Schrute",
    "content": "There are a huge number of yeast infections in this county. Probably because we’re downriver from that old bread factory."
  },
  {
    "character": "Dwight Schrute",
    "content": "I signed up for second life about a year ago. Back then, my life was so great that I literally wanted a second one. Absolutely everything was the same… except I could fly."
  },
  {
    "character": "Dwight Schrute",
    "content": "Of course, martial arts training is relevant… Uh, I know about a billion Asians that would beg to differ… You know what, you can go to hell, and I will see you there. Burning!"
  },
  {
    "character": "Dwight Schrute",
    "content": "The eyes are the groin of the head."
  },
  {
    "character": "Dwight Schrute",
    "content": "D.W.I.G.H.T. Determined. Worker. Intense. Good worker. Hard worker. Terrific."
  },
  {
    "character": "Dwight Schrute",
    "content": "I come from a long line of fighters. My maternal grandfather was the toughest guy I ever knew. World War II veteran killed twenty men and spent the rest of the war in an allied prison camp. My father battled blood pressure and obesity all his life. Different kind of fight."
  },
  {
    "character": "Dwight Schrute",
    "content": "No, don’t call me a hero. Do you know who the real heroes are? The guys who wake up every morning and go into their normal jobs and get a distress call from the Commissioner and take off their glasses and change into capes and fly around fighting crime. Those are the real heroes."
  },
  {
    "character": "Dwight Schrute",
    "content": "As a volunteer Sheriff’s Deputy, I’ve been doing surveillance for years. One time I suspected an ex-girlfriend of mine of cheating on me, so I tailed her for six nights straight. Turns out… she was. With a couple of guys actually, so… mystery solved."
  },
  {
    "character": "Dwight Schrute",
    "content": "To avoid illness, expose yourself to germs, enabling your immune system to develop antibodies. I don’t know why everyone doesn’t do this. Maybe they have something against living forever."
  },
  {
    "character": "Dwight Schrute",
    "content": "Dolphins get a lot of good publicity for the drowning swimmers they push back to shore, but what you don’t hear about is the many people they push farther out to sea! Dolphins aren’t smart. They just like pushing things."
  },
  {
    "character": "Dwight Schrute",
    "content": "Once I’m officially Regional Manager, my first order of business will be to demote Jim Halpert. So, I will need a new number two. My ideal choice? Jack Bauer. But he is unavailable. Fictional. And overqualified."
  },
  {
    "character": "Dwight Schrute",
    "content": "Reject a woman and she will never let it go. One of the many defects of their kind. Also, weak arms."
  },
  {
    "character": "Dwight Schrute",
    "content": "Now that I own the building, I’m looking for new sources of revenue. And a daycare center? Muahahahahahahahaha. Well, I guess it’s not an evil idea, it’s just a regular idea, but there’s no good laugh for a regular idea."
  },
  {
    "character": "Dwight Schrute",
    "content": "Why tip someone for a job I’m capable of doing myself? I can deliver food. I can drive a taxi. I can, and do, cut my own hair. I did, however, tip my urologist, because I am unable to pulverize my own kidney stones."
  },
  {
    "character": "Dwight Schrute",
    "content": "Fortunately, my feelings regenerate at twice the speed of a normal man’s."
  },
  {
    "character": "Dwight Schrute",
    "content": "It’s never the person who you most suspect. It’s also never the person you least suspect, since anyone with half a brain would suspect them the most. Therefore, I know the killer to be Phyllis. The person who I most medium suspect."
  },
  {
    "character": "Dwight Schrute",
    "content": "It’s a real shame because studies have shown that more information gets passed through water cooler gossip than through official memos. Which puts me at a disadvantage because I bring my own water to work."
  },
  {
    "character": "Dwight Schrute",
    "content": "‘R’ is among the most menacing of sounds. That’s why they call it ‘murder’ and not mukduk’."
  },
  {
    "character": "Dwight Schrute",
    "content": "At first, I drove myself crazy thinking about the things I should have done differently. I never should have played that joke on Erin. I never should have hollowed out this damn pumpkin in the first place. Then I realized that I was being silly. I mean, the pumpkin should rot off of my head in a month or two. Right?"
  },
  {
    "character": "Dwight Schrute",
    "content": "Yes, I have a wig for every single person in the office. You never know when you’re gonna need to bear a passing resemblance to someone."
  },
  {
    "character": "Dwight Schrute",
    "content": "OK, see you later, Pan."
  },
  {
    "character": "Dwight Schrute",
    "content": "Jim couldn’t land me in a thousand years."
  },
  {
    "character": "Dwight Schrute",
    "content": "I wonder if king-sized sheets are called presidential-sized in England."
  },
  {
    "character": "Dwight Schrute",
    "content": "I really should have a Tweeter account."
  },
  {
    "character": "Dwight Schrute",
    "content": "Ah, humor. I have it, too."
  },
  {
    "character": "Dwight Schrute",
    "content": "I hope the war goes on forever and Ryan gets drafted. I’m sorry, only part of me meant that. He’d probably end up a hero there, anyway."
  },
  {
    "character": "Dwight Schrute",
    "content": "Get a friend, loser."
  },
  {
    "character": "Dwight Schrute",
    "content": "I don’t care what Jim says. This is NOT the real Ben Franklin. I am 99.9 percent sure."
  },
  {
    "character": "Dwight Schrute",
    "content": "What is my perfect crime? I break into Tiffany’s at midnight. Do I go for the vault? No, I go for the chandelier. It’s priceless. As I’m taking it down, a woman catches me. She tells me to stop. It’s her father’s business. She’s Tiffany. I say no. We make love all night. In the morning, the cops come, and I escape in one of their uniforms. I tell her to meet me in Mexico, but I go to Canada. I don’t trust her. Besides, I like the cold. Thirty years later, I get a postcard. I have a son, and he’s the chief of police. This is where the story gets interesting. I tell Tiffany to meet me in Paris by the Trocadero. She’s been waiting for me all these years. She’s never taken another lover. I don’t care. I don’t show up. I go to Berlin. That’s where I stashed the chandelier."
  },
  {
    "character": "Dwight Schrute",
    "content": "Yes, I have acted before. I was in a production of Oklahoma! In the seventh grade. I played the part of Mutey the Mailman. They had too many kids, so they made up roles like that. I was good."
  },
  {
    "character": "Dwight Schrute",
    "content": "Listen up, Flenderson, you’re being weak and ineffectual. I’m cowboying this meeting, OK! Here are the new rules, OK? Earth tones only. Also, women are forbidden to wear pants."
  },
  {
    "character": "Dwight Schrute",
    "content": "When held over heat, the invisible ink will reveal that everyone should meet at the warehouse immediately. Do not ask me where I got the invisible ink. Urine. It was urine."
  },
  {
    "character": "Dwight Schrute",
    "content": "Yes, I am taking Andy hunting after work. Not long ago we were sexual competitors. I used to hate him, hate him, hate him, hate him. I studied him, to figure out why I hated him so much. But that blossomed into a very real friendship, as these things often do."
  },
  {
    "character": "Dwight Schrute",
    "content": "Oh, you know that line on the top of the shrimp? That’s feces."
  },
  {
    "character": "Dwight Schrute",
    "content": "There was a terrible war, ugh, so many died. Far too many died. But if Frodo hadn’t destroyed the ring, then goodness itself might have died."
  },
  {
    "character": "Dwight Schrute",
    "content": "Michael always says, ‘K-I-S-S: keep it simple, stupid.’ Great advice. Hurts my feelings every time."
  },
  {
    "character": "Dwight Schrute",
    "content": "Five minutes ahead of schedule… right on schedule."
  },
  {
    "character": "Dwight Schrute",
    "content": "Can’t a guy just buy some bagels for his friends so they’ll owe him a favor which he can use to get someone fired who stole a co-manager position from him anymore? Jeez. When did everyone get so cynical?"
  },
  {
    "character": "Dwight Schrute",
    "content": "You know, I really would’ve appreciated a heads up that you were into dating mothers. I would’ve introduced you to mine."
  },
  {
    "character": "Dwight Schrute",
    "content": "Schrute Farms is very easy to find. It’s right in the middle of the root vegetable district. If the soil starts to get acidic, you’ve gone too far."
  },
  {
    "character": "Dwight Schrute",
    "content": "All that singing got in the way of some perfectly good murders."
  },
  {
    "character": "Dwight Schrute",
    "content": "I always knew I would be destroyed by my own creation, but honestly, I thought it would be that bull that Mose and I are trying to reanimate."
  },
  {
    "character": "Dwight Schrute",
    "content": "Do I have a date for Valentine’s Day? Yes. February 14th."
  },
  {
    "character": "Dwight Schrute",
    "content": "Today, smoking is going to save lives."
  },
  {
    "character": "Dwight Schrute",
    "content": "If I were buying my coffin, I would get one with thicker walls so you couldn’t hear the other dead people."
  },
  {
    "character": "Dwight Schrute",
    "content": "Schrutes don’t celebrate birthdays, idiot. It started as a depression-era practicality and then, moved on to an awesome tradition that I look forward to every year!"
  },
  {
    "character": "Dwight Schrute",
    "content": "It’s not effeminate. It’s festive."
  },
  {
    "character": "Dwight Schrute",
    "content": "I sat at my desk all day with a rifle that shoots potatoes at 60 pounds per square inch. Can you imagine if I was deranged?"
  },
  {
    "character": "Dwight Schrute",
    "content": "I studied him, to figure out why I hated him so much. But that blossomed into a very real friendship, as these things often do."
  },
  {
    "character": "Dwight Schrute",
    "content": "I wonder if king-sized sheets are called presidential-sized in England?"
  },
  {
    "character": "Dwight Schrute",
    "content": "As a farmer, I know that when an animal is sick, sometimes the right thing to do is put it out of its misery. With the electricity we are using to keep Meredith alive, we could power a small fan for two days. You tell me what’s unethical."
  },
  {
    "character": "Dwight Schrute",
    "content": "Welcome to the Hotel Hell. Check-in time is now. Check-out time is never."
  },
  {
    "character": "Dwight Schrute",
    "content": "Bears are more afraid of you than you are of them? You obviously aren’t scared enough."
  },
  {
    "character": "Dwight Schrute",
    "content": "Love is all you need? False, you need water and rations."
  },
  {
    "character": "Dwight Schrute",
    "content": "The principle is sound. To avoid illness, expose yourself to germs, enabling your immune system to develop antibodies. I don’t know why everyone doesn’t do this… maybe they have something against living forever."
  },
  {
    "character": "Dwight Schrute",
    "content": "OK. When the baby emerges, mark it secretly in a kind of a mark that only you could recognize and no baby snatcher could ever copy."
  },
  {
    "character": "Dwight Schrute",
    "content": "Babies are one of my many areas of expertise. Growing up, I performed my own circumcision."
  },
  {
    "character": "Dwight Schrute",
    "content": "Twelve hundred dollars is what I spent on my whole bomb shelter. For that kind of money, this stroller, should be indestructible."
  },
  {
    "character": "Dwight Schrute",
    "content": "Hold me! Cradle my hand!"
  },
  {
    "character": "Dwight Schrute",
    "content": "I’m screaming! I’m screaming! I’m screaming! Aah! Numb me up! I want anesthesia!"
  },
  {
    "character": "Dwight Schrute",
    "content": "Sasquatches are the strongest animal on the planet, so fine call me a Sasquatch!"
  },
  {
    "character": "Dwight Schrute",
    "content": "A hero kills people, people that wish him harm. A hero is part human and part supernatural. A hero is born out of a childhood trauma, or out of a disaster, that must be avenged."
  },
  {
    "character": "Dwight Schrute",
    "content": "Will I get over it? Mmm. No. But life goes on."
  },
  {
    "character": "Dwight Schrute",
    "content": "Jim is my enemy. But it turns out that Jim is also his own worst enemy. And the enemy of my enemy is my friend. So, Jim is actually my friend. But because he is his own worst enemy, the enemy of my friend is my enemy so, actually, Jim is my enemy."
  },
  {
    "character": "Dwight Schrute",
    "content": "You only live once? False. You live every day. You only die once."
  },
  {
    "character": "Dwight Schrute",
    "content": "He’s gone. I miss him so much. Oh, I cry myself to sleep, Jim. False. I do not miss him."
  },
  {
    "character": "Creed Bratton",
    "content": "I wanna do a cartwheel. But real casual-like. Not enough to make a big deal out of it, but I know everyone saw it. One stunning, gorgeous cartwheel."
  },
  {
    "character": "Creed Bratton",
    "content": "I run a small fake ID company from my car with a laminating machine that I swiped from the Sheriff’s station."
  },
  {
    "character": "Creed Bratton",
    "content": "Oh, you’re paying way too much for worms. Who’s your worm guy?"
  },
  {
    "character": "Creed Bratton",
    "content": "I’ve been involved in a number of cults, both a leader and a follower. You have more fun as a follower, but you make more money as a leader."
  },
  {
    "character": "Creed Bratton",
    "content": "If I can’t scuba, then what’s this all been about? What am I working toward?"
  },
  {
    "character": "Creed Bratton",
    "content": "I already won the lottery. I was born in the US of A, baby. And as backup, I have a Swiss passport."
  },
  {
    "character": "Creed Bratton",
    "content": "Nobody steals from Creed Bratton and gets away with it. The last person to do this disappeared. His name? Creed Bratton."
  },
  {
    "character": "Creed Bratton",
    "content": "Creed Bratton has never declared bankruptcy. When Creed Bratton gets in trouble, he transfers his debt to William Charles Scheider."
  },
  {
    "character": "Creed Bratton",
    "content": "Let’s put a smile on that face."
  },
  {
    "character": "Creed Bratton",
    "content": "When Pam gets Michael’s old chair, I get Pam’s old chair. Then I’ll have two chairs. Only one to go."
  },
  {
    "character": "Creed Bratton",
    "content": "You know a human can go on living for several hours after being decapitated."
  },
  {
    "character": "Creed Bratton",
    "content": "I’m not offended by homosexuality. In the ’60s I made love to many, many women, often outdoors, in the mud and the rain… and it’s possible a man slipped in. (S<em>hrugs</em>) There’d be no way of knowing."
  },
  {
    "character": "Creed Bratton",
    "content": "In the parking lot today, there was a circus! The copier did tricks on the high-wire. A lady tried to give away a baby that looked like a cat. There was a Dwight impersonator and a Jim impersonator. A strongman crushed a turtle; I laughed, and I cried. Not bad for a day in the life of a dog food company."
  },
  {
    "character": "Pam Beesly",
    "content": "And I feel God in this Chili’s tonight."
  },
  {
    "character": "Pam Beesly",
    "content": "You know what they say about a car wreck, where it’s so awful you can’t look away? The Dundies are like a car wreck that you want to look away from, but you have to stare at it because your boss is making"
  },
  {
    "character": "Pam Beesly",
    "content": "I don’t care what they say about me. I just want to eat. Which I realize is a lot to ask for…at a dinner party."
  },
  {
    "character": "Pam Beesly",
    "content": "How is it possible that in five years, I’ve had two engagements and only one chair?"
  },
  {
    "character": "Pam Beesly",
    "content": "I’m guessing Angela is the one in the neighborhood that gives the trick-or-treaters toothbrushes, pennies, walnuts."
  },
  {
    "character": "Pam Beesly",
    "content": "I hate the idea that someone out there hates me. I even hate thinking that Al Qaeda hates me. I think if they got to know me, they wouldn’t hate me."
  },
  {
    "character": "Angela Martin",
    "content": "I find the mystery genre disgusting. I hate being titillated."
  },
  {
    "character": "Angela Martin",
    "content": "I think green is kind of whorish."
  },
  {
    "character": "Angela Martin",
    "content": "I know that patience and loyalty are good, and virtuous traits. But sometimes I just think you need to grow a pair."
  },
  {
    "character": "Andy Bernard",
    "content": "I'm always thinking one step ahead, like a carpenter who makes stairs."
  },
  {
    "character": "Andy Bernard",
    "content": "Sorry I annoyed you with my friendship."
  },
  {
    "character": "Jim Halpert",
    "content": "I'm going to do something I've never done at this job before - try."
  },
  {
    "character": "Jim Halpert",
    "content": "I miss Dwight. Congratulations Universe, you win."
  },
  {
    "character": "Jim Halpert",
    "content": "I bought those boat tickets the day I saw that You Tube video. I knew we'd need a back-up plan. The boat was actually Plan C. The church was Plan B and Plan A was marrying her a long, long time ago. Pretty much the day I met her."
  },
  {
    "character": "Jim Halpert",
    "content": "Not enough for me? You are everything."
  },
  {
    "character": "Jim Halpert",
    "content": "Michael will be related to this baby through... delusion."
  },
  {
    "character": "Jim Halpert",
    "content": "Hey, what has two thumbs and hates Todd Packer? This guy."
  },
  {
    "character": "Kevin Malone",
    "content": "When I President, they see. They see."
  },
  {
    "character": "Kelly Kapoor",
    "content": "I don't talk trash; I talk smack. They're totally different. Trash talk is all hypothetical, like, 'Your Mama's so fat she could eat the internet', but smack talk is happening like right now, like, 'You're ugly and I know it for a fact 'cause I got the evidence right there.'"
  },
  {
    "character": "Kelly Kapoor",
    "content": "I am one of the few people who looks hot eating a cupcake."
  },
  {
    "character": "Kelly Kapoor",
    "content": "This day is BANANAS! B-A-N-A-N-A-S!"
  },
  {
    "character": "Stanley Hudson",
    "content": "Did I stutter?"
  },
  {
    "character": "Stanley Hudson",
    "content": "I wake up every morning in a bed that’s too small, drive my daughter to a school that’s too expensive, and then I go to work to a job for which I get paid too little, but on pretzel day? Well, I like pretzel day.."
  },
  {
    "character": "Stanley Hudson",
    "content": "It's like I used to tell my wife: I do not apologize unless I think I'm wrong, and if you don't like it, you can leave. I say the same thing to my current wife, and I'll say it to my next one too."
  },
  {
    "character": "Stanley Hudson",
    "content": "Boy, have you lost your mind, 'cause I will help you find it!"
  }
]
